docs/bench/bench_full-4_Per-peer Replicator.txt
ERROR: failed to fetch CONFIG from 127.0.0.1:6379
WARN: could not fetch server CONFIG
====== SET ======
  10000 requests completed in 3.37 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  multi-thread: no

0.01% <= 0.9 milliseconds
0.02% <= 1.0 milliseconds
0.03% <= 1.1 milliseconds
0.04% <= 1.2 milliseconds
0.05% <= 1.3 milliseconds
0.08% <= 1.4 milliseconds
0.12% <= 1.5 milliseconds
0.22% <= 1.6 milliseconds
0.36% <= 1.7 milliseconds
0.44% <= 1.8 milliseconds
0.60% <= 1.9 milliseconds
0.80% <= 2 milliseconds
2.12% <= 3 milliseconds
3.77% <= 4 milliseconds
5.90% <= 5 milliseconds
8.67% <= 6 milliseconds
11.16% <= 7 milliseconds
14.92% <= 8 milliseconds
19.14% <= 9 milliseconds
25.65% <= 10 milliseconds
31.98% <= 11 milliseconds
37.83% <= 12 milliseconds
45.06% <= 13 milliseconds
52.53% <= 14 milliseconds
58.84% <= 15 milliseconds
64.22% <= 16 milliseconds
68.23% <= 17 milliseconds
71.45% <= 18 milliseconds
73.68% <= 19 milliseconds
75.53% <= 20 milliseconds
77.20% <= 21 milliseconds
78.72% <= 22 milliseconds
79.75% <= 23 milliseconds
81.22% <= 24 milliseconds
82.22% <= 25 milliseconds
83.15% <= 26 milliseconds
84.46% <= 27 milliseconds
85.46% <= 28 milliseconds
86.35% <= 29 milliseconds
87.13% <= 30 milliseconds
87.92% <= 31 milliseconds
88.89% <= 32 milliseconds
89.85% <= 33 milliseconds
90.66% <= 34 milliseconds
91.38% <= 35 milliseconds
92.12% <= 36 milliseconds
92.53% <= 37 milliseconds
93.11% <= 38 milliseconds
93.72% <= 39 milliseconds
94.54% <= 40 milliseconds
95.26% <= 41 milliseconds
95.86% <= 42 milliseconds
96.88% <= 43 milliseconds
97.70% <= 44 milliseconds
98.19% <= 45 milliseconds
98.62% <= 46 milliseconds
98.89% <= 47 milliseconds
99.05% <= 48 milliseconds
99.15% <= 49 milliseconds
99.43% <= 50 milliseconds
99.66% <= 51 milliseconds
99.89% <= 52 milliseconds
99.97% <= 53 milliseconds
100.00% <= 53 milliseconds
2969.12 requests per second

====== GET ======
  10000 requests completed in 2.74 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  multi-thread: no

0.01% <= 1 milliseconds
0.27% <= 2 milliseconds
1.14% <= 3 milliseconds
2.89% <= 4 milliseconds
4.87% <= 5 milliseconds
8.02% <= 6 milliseconds
13.18% <= 7 milliseconds
20.98% <= 8 milliseconds
32.01% <= 9 milliseconds
42.38% <= 10 milliseconds
50.94% <= 11 milliseconds
58.42% <= 12 milliseconds
64.27% <= 13 milliseconds
68.84% <= 14 milliseconds
71.52% <= 15 milliseconds
74.62% <= 16 milliseconds
76.92% <= 17 milliseconds
78.63% <= 18 milliseconds
79.87% <= 19 milliseconds
81.08% <= 20 milliseconds
82.73% <= 21 milliseconds
84.00% <= 22 milliseconds
85.23% <= 23 milliseconds
86.17% <= 24 milliseconds
87.56% <= 25 milliseconds
89.04% <= 26 milliseconds
90.20% <= 27 milliseconds
91.39% <= 28 milliseconds
92.91% <= 29 milliseconds
94.26% <= 30 milliseconds
95.11% <= 31 milliseconds
95.80% <= 32 milliseconds
96.22% <= 33 milliseconds
96.70% <= 34 milliseconds
97.12% <= 35 milliseconds
97.52% <= 36 milliseconds
97.82% <= 37 milliseconds
98.14% <= 38 milliseconds
98.54% <= 39 milliseconds
98.91% <= 40 milliseconds
99.10% <= 41 milliseconds
99.41% <= 42 milliseconds
99.64% <= 43 milliseconds
99.77% <= 44 milliseconds
99.93% <= 45 milliseconds
99.94% <= 46 milliseconds
99.96% <= 47 milliseconds
99.97% <= 48 milliseconds
100.00% <= 48 milliseconds
3642.99 requests per second