docs/bench/bench_full-5_ReadIndex.txt
ERROR: failed to fetch CONFIG from 127.0.0.1:6379
WARN: could not fetch server CONFIG
====== SET ======
  10000 requests completed in 3.66 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  multi-thread: no

0.01% <= 1.2 milliseconds
0.02% <= 1.3 milliseconds
0.04% <= 1.4 milliseconds
0.05% <= 1.5 milliseconds
0.11% <= 1.6 milliseconds
0.16% <= 1.7 milliseconds
0.22% <= 1.8 milliseconds
0.37% <= 1.9 milliseconds
0.46% <= 2 milliseconds
1.76% <= 3 milliseconds
3.30% <= 4 milliseconds
5.17% <= 5 milliseconds
7.85% <= 6 milliseconds
10.20% <= 7 milliseconds
13.00% <= 8 milliseconds
16.97% <= 9 milliseconds
21.32% <= 10 milliseconds
26.65% <= 11 milliseconds
31.11% <= 12 milliseconds
37.93% <= 13 milliseconds
44.25% <= 14 milliseconds
49.09% <= 15 milliseconds
53.74% <= 16 milliseconds
58.45% <= 17 milliseconds
62.41% <= 18 milliseconds
65.66% <= 19 milliseconds
68.01% <= 20 milliseconds
70.28% <= 21 milliseconds
72.39% <= 22 milliseconds
74.45% <= 23 milliseconds
76.06% <= 24 milliseconds
77.96% <= 25 milliseconds
79.15% <= 26 milliseconds
80.89% <= 27 milliseconds
82.59% <= 28 milliseconds
84.40% <= 29 milliseconds
85.86% <= 30 milliseconds
87.68% <= 31 milliseconds
89.65% <= 32 milliseconds
90.58% <= 33 milliseconds
92.03% <= 34 milliseconds
92.97% <= 35 milliseconds
93.95% <= 36 milliseconds
95.25% <= 37 milliseconds
95.92% <= 38 milliseconds
96.51% <= 39 milliseconds
96.72% <= 40 milliseconds
96.99% <= 41 milliseconds
97.24% <= 42 milliseconds
97.44% <= 43 milliseconds
97.68% <= 44 milliseconds
97.83% <= 45 milliseconds
98.07% <= 46 milliseconds
98.15% <= 47 milliseconds
98.23% <= 48 milliseconds
98.37% <= 49 milliseconds
98.66% <= 50 milliseconds
98.78% <= 51 milliseconds
98.97% <= 52 milliseconds
99.02% <= 53 milliseconds
99.03% <= 59 milliseconds
99.04% <= 60 milliseconds
99.05% <= 62 milliseconds
99.23% <= 63 milliseconds
99.52% <= 78 milliseconds
99.53% <= 80 milliseconds
99.54% <= 83 milliseconds
99.55% <= 84 milliseconds
99.56% <= 91 milliseconds
99.61% <= 92 milliseconds
99.67% <= 93 milliseconds
99.68% <= 99 milliseconds
99.82% <= 100 milliseconds
99.98% <= 101 milliseconds
100.00% <= 101 milliseconds
2730.00 requests per second

====== GET ======
  10000 requests completed in 2.34 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  multi-thread: no

0.03% <= 1 milliseconds
0.06% <= 2 milliseconds
0.10% <= 4 milliseconds
0.21% <= 5 milliseconds
1.66% <= 6 milliseconds
17.63% <= 7 milliseconds
47.53% <= 8 milliseconds
64.84% <= 9 milliseconds
69.33% <= 10 milliseconds
71.30% <= 11 milliseconds
72.73% <= 12 milliseconds
73.81% <= 13 milliseconds
75.10% <= 14 milliseconds
76.18% <= 15 milliseconds
76.99% <= 16 milliseconds
78.23% <= 17 milliseconds
80.01% <= 18 milliseconds
81.74% <= 19 milliseconds
83.20% <= 20 milliseconds
85.03% <= 21 milliseconds
86.49% <= 22 milliseconds
88.71% <= 23 milliseconds
91.08% <= 24 milliseconds
94.08% <= 25 milliseconds
96.01% <= 26 milliseconds
97.28% <= 27 milliseconds
98.12% <= 28 milliseconds
98.58% <= 29 milliseconds
99.08% <= 30 milliseconds
99.40% <= 31 milliseconds
99.50% <= 32 milliseconds
99.51% <= 51 milliseconds
99.56% <= 52 milliseconds
99.64% <= 53 milliseconds
99.69% <= 54 milliseconds
99.73% <= 56 milliseconds
99.74% <= 57 milliseconds
99.79% <= 58 milliseconds
99.83% <= 59 milliseconds
99.90% <= 60 milliseconds
99.91% <= 61 milliseconds
99.94% <= 62 milliseconds
99.98% <= 63 milliseconds
100.00% <= 63 milliseconds
4280.82 requests per second